import "./Manegment.css";
import Header from "../../components/header/Header";
import { Container, Row } from "react-bootstrap";
import ManagementItems from "./ManagementItems";
import ImgCaders from "../../assets/images/section2-bac.jpg";
function Management() {
  let ManagementCadrs = [
    {
      id: 1,
      img: ImgCaders,
      name: "سورنا رفیعی",
      title: "مدیر رستوران",
      desc: "لورم ایپسوم متن ساختگی از صنعت چاپ، و با استفاده از طراحان گرافیک است، چاپگرها و متون بلکه روزنامه و مجله در ستون و سطرآنچنان که لازم است، و برای شرایط فعلی تکنولوژی مورد نیاز، و کاربردهای متنوع با هدف بهبود ابزارهای کاربردی ان جامعه و متخصصواشت که تما شامل حروفچیرد",
    },
    {
      id: 2,
      img: ImgCaders,
      name: "یاسر انتظاری",
      title: "سر آشپز رستوران",
      desc: "لورم ایپسوم متن ساختگی از صنعت چاپ، و با استفاده از طراحان گرافیک است، چاپگرها و متون بلکه روزنامه و مجله در ستون و سطرآنچنان که لازم است، و برای شرایط فعلی تکنولوژی مورد نیاز، و کاربردهای متنوع با هدف بهبود ابزارهای کاربردی ان جامعه و متخصصواشت که تما شامل حروفچیرد",
    },
    {
      id: 3,
      img: ImgCaders,
      name: "پوری شاه محمدی",
      title: "اشپز رستوران",
      desc: "لورم ایپسوم متن ساختگی از صنعت چاپ، و با استفاده از طراحان گرافیک است، چاپگرها و متون بلکه روزنامه و مجله در ستون و سطرآنچنان که لازم است، و برای شرایط فعلی تکنولوژی مورد نیاز، و کاربردهای متنوع با هدف بهبود ابزارهای کاربردی ان جامعه و متخصصواشت که تما شامل حروفچیرد",
    },
    {
      id: 4,
      img: ImgCaders,
      name: "داریوش حکیمی",
      title: "حسابدار رستوران",
      desc: "لورم ایپسوم متن ساختگی از صنعت چاپ، و با استفاده از طراحان گرافیک است، چاپگرها و متون بلکه روزنامه و مجله در ستون و سطرآنچنان که لازم است، و برای شرایط فعلی تکنولوژی مورد نیاز، و کاربردهای متنوع با هدف بهبود ابزارهای کاربردی ان جامعه و متخصصواشت که تما شامل حروفچیرد",
    },
    {
      id: 5,
      img: ImgCaders,
      name: "کوروش دهقان",
      title: "گارسون رستوران",
      desc: "لورم ایپسوم متن ساختگی از صنعت چاپ، و با استفاده از طراحان گرافیک است، چاپگرها و متون بلکه روزنامه و مجله در ستون و سطرآنچنان که لازم است، و برای شرایط فعلی تکنولوژی مورد نیاز، و کاربردهای متنوع با هدف بهبود ابزارهای کاربردی ان جامعه و متخصصواشت که تما شامل حروفچیرد",
    },
  ];

  return (
    <div>
      <div className="section-management margin-management">
        <Container>
          <Row>
            {ManagementCadrs.map((cadr) => (
              <ManagementItems key={cadr.id} {...cadr} />
            ))}
          </Row>
        </Container>
      </div>
    </div>
  );
}

export default Management;
