import "./AboutUs.css"
import Header from "../../components/header/Header"
import Footer from "../../components/footer/Footer"
import { Col, Container, Row } from "react-bootstrap"
import Card from 'react-bootstrap/Card';
import ListGroup from 'react-bootstrap/ListGroup';
import { Link } from "react-router-dom";
import img from "../../assets/images/section2-bac.jpg"
import img1 from "../../assets/images/success.jpg"
import Images from "./Images";
import SlideShow from "./SlideShow";
function AboutUs(){

    const imagesData = [
        {
            id : 1 ,
            img : img ,
            title : "هنرستان نمونه دولتی خادمی از چه سالی تاسیس شد و چقدر زیربنا دارد ؟" , 
            desc : "لورم ایپسوم متن ساختگی با تولید سادگی نامفهوم از صنعت چاپ، و با استفاده از طراحان گرافیک است، چاپگرها و متون بلکه روزنامه و مجله در ستون و سطرآنچنان که لازم است، و برای شرایط فعلی تکنولوژی مورد نیاز، و کاربردهای متنوع با هدف بهبود ابزارهای کاربردی می باشد، کتابهای زیادی در شصت و سه درصد گذشته حال و آینده، شناخت فراوان جامعه و متخصصان را می طلبد، تا با نرم افزارها شناخت بیشتری را برای طراحان رایانه ای علی الخصوص طراحان خلاقی، و فرهنگ پیشرو در زبان فارسی ایجاد کرد، در این صورت می توان امید داشت که تمام و دشواری موجود در ارائه راهکارها، و شرایط سخت تایپ به پایان رسد و زمان مورد نیاز شامل حروفچینی دستاوردهای اصلی، و جوابگوی سوالات پیوسته اهل دنیای موجود طراحی اساسا مورد استفاده قرار گیرد."
        },
        {
            id : 2 ,
            img : img ,
            title : "هنرستان نمونه دولتی خادمی چند کلاس و چند کارگاه آموزشی دارد ؟ هر رشته چند کارگاه آموزشی دارد ؟" , 
           desc : "لورم ایپسوم متن ساختگی با تولید سادگی نامفهوم از صنعت چاپ، و با استفاده از طراحان گرافیک است، چاپگرها و متون بلکه روزنامه و مجله در ستون و سطرآنچنان که لازم است، و برای شرایط فعلی تکنولوژی مورد نیاز، و کاربردهای متنوع با هدف بهبود ابزارهای کاربردی می باشد، کتابهای زیادی در شصت و سه درصد گذشته حال و آینده، شناخت فراوان جامعه و متخصصان را می طلبد، تا با نرم افزارها شناخت بیشتری را برای طراحان رایانه ای علی الخصوص طراحان خلاقی، و فرهنگ پیشرو در زبان فارسی ایجاد کرد، در این صورت می توان امید داشت که تمام و دشواری موجود در ارائه راهکارها، و شرایط سخت تایپ به پایان رسد و زمان مورد نیاز شامل حروفچینی دستاوردهای اصلی، و جوابگوی سوالات پیوسته اهل دنیای موجود طراحی اساسا مورد استفاده قرار گیرد."
        }
    ]
    const SlideShowData = [
        {
            id : 1 ,
            image : img ,
            title : "هنرستان نمونه دولتی خادمی از چه سالی تاسیس شد و چقدر زیربنا دارد ؟" , 
            desc : "لورم ایپسوم متن ساختگی با تولید سادگی نامفهوم از صنعت چاپ، و با استفاده از طراحان گرافیک است، چاپگرها و متون بلکه روزنامه و مجله در ستون و سطرآنچنان که لازم است، و برای شرایط فعلی تکنولوژی مورد نیاز، و کاربردهای متنوع با هدف بهبود ابزارهای کاربردی می باشد، کتابهای زیادی در شصت و سه درصد گذشته حال و آینده، شناخت فراوان جامعه و متخصصان را می طلبد، تا با نرم افزارها شناخت بیشتری را برای طراحان رایانه ای علی الخصوص طراحان خلاقی، و فرهنگ پیشرو در زبان فارسی ایجاد کرد، در این صورت می توان امید داشت که تمام و دشواری موجود در ارائه راهکارها، و شرایط سخت تایپ به پایان رسد و زمان مورد نیاز شامل حروفچینی دستاوردهای اصلی، و جوابگوی سوالات پیوسته اهل دنیای موجود طراحی اساسا مورد استفاده قرار گیرد."
        },
        {
            id : 2 ,
            image : img1 ,
            title : "هنرستان نمونه دولتی خادمی چند کلاس و چند کارگاه آموزشی دارد ؟ هر رشته چند کارگاه آموزشی دارد ؟" , 
           desc : "لورم ایپسوم متن ساختگی با تولید سادگی نامفهوم از صنعت چاپ، و با استفاده از طراحان گرافیک است، چاپگرها و متون بلکه روزنامه و مجله در ستون و سطرآنچنان که لازم است، و برای شرایط فعلی تکنولوژی مورد نیاز، و کاربردهای متنوع با هدف بهبود ابزارهای کاربردی می باشد، کتابهای زیادی در شصت و سه درصد گذشته حال و آینده، شناخت فراوان جامعه و متخصصان را می طلبد، تا با نرم افزارها شناخت بیشتری را برای طراحان رایانه ای علی الخصوص طراحان خلاقی، و فرهنگ پیشرو در زبان فارسی ایجاد کرد، در این صورت می توان امید داشت که تمام و دشواری موجود در ارائه راهکارها، و شرایط سخت تایپ به پایان رسد و زمان مورد نیاز شامل حروفچینی دستاوردهای اصلی، و جوابگوی سوالات پیوسته اهل دنیای موجود طراحی اساسا مورد استفاده قرار گیرد."
        }
    ]
    return(
        <>
        <Header/>
            <Container>
                <Row>
                    <Col sm={12} md={4} className="mt-3">
                        <Card className="bg-info">
                        <Card.Header className="text-dark">دسته بندی</Card.Header>
                        <ListGroup variant="flush">
                            <ListGroup.Item>
                                <Link className="text-dark text-decoration-none p-2 border-style" to={"/aboutus"}>درباره هنرستان</Link>
                            </ListGroup.Item>
                            <ListGroup.Item>
                                <Link className="text-dark text-decoration-none p-2" to={"/contact"}>ارتباط با هنرستان</Link>
                            </ListGroup.Item>
                            <ListGroup.Item>
                                <Link className="text-dark text-decoration-none p-2" to={"/honors"}>افتخارات</Link>
                            </ListGroup.Item>
                        </ListGroup>
                        </Card>
                        <Card className="my-3 shadow ">
                        <Card.Img variant="top" src={img} />
                        <Card.Body className="bg-box">
                            <Card.Title className="my-3 text-color">حاج عباس خادمی</Card.Title>
                            <Card.Title className="my-3 text-dark opacity-50">
                            <h6>خیر مدرسه ساز&#10078; سازنده هنرستان نمونه دولتی خادمی &#10077;</h6>
                            </Card.Title>
                            <Card.Text className="rounded-bottom">
                            <p className="text-justify">
                            لورم ایپسوم متن ساختگی با تولید سادگی نامفهوم از صنعت چاپ، و با استفاده از طراحان گرافیک است، چاپگرها و متون بلکه روزنامه و مجله در ستون و سطرآنچنان که لازم است، و برای شرایط فعلی تکنولوژی مورد نیاز، و کاربردهای متنوع با هدف بهبود ابزارهای کاربردی می باشد، کتابهای زیادی در شصت و سه درصد گذشته حال و آینده، شناخت فراوان جامعه و متخصصان را می طلبد، تا با نرم افزارها شناخت بیشتری را برای طراحان رایانه ای علی الخصوص طراحان خلاقی، و فرهنگ پیشرو در زبان فارسی ایجاد کرد، در این صورت می توان امید داشت که تمام و دشواری موجود در ارائه راهکارها، و شرایط سخت تایپ به پایان رسد و زمان مورد نیاز شامل حروفچینی دستاوردهای اصلی، و جوابگوی سوالات پیوسته اهل دنیای موجود طراحی اساسا مورد استفاده قرار گیرد.
                            </p>
                            </Card.Text>
                        </Card.Body>
                        </Card>
                    </Col>
                    <Col sm={12} md={8}>
                        {/* just images */}
                        <Row className="my-3 d-flex flex-row bg-box shadow p-3 rounded-2">
                            {imagesData.map(Item => (
                                <Images key={Item.id} {...Item}/>
                            ))}
                        </Row>
                        {/* carousel */}
                        <Row></Row>
                            {SlideShowData.map(Items => (
                                <SlideShow key={Items.id} {...Items}/>
                            ))}
                    </Col> 
                </Row>
            </Container>
        <Footer/>
        </>
    )
}
export default AboutUs